{"config": [{"config": {"use_bias": true, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_1", "activation": "sigmoid", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 784], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 32}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_2", "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 32}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_3", "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 32}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_4", "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 10}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}